# 索引

In [13]:
import numpy as np

import pandas as pd

obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=['ohio','colorado','utah','new york'],
                 columns=['ones','two','three','four'])

In [3]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [4]:
data

          ones  two  three  four
ohio         0    1      2     3
colorado     4    5      6     7
utah         8    9     10    11
new york    12   13     14    15

**可以通过单个索引，或者索引列表来进行索引**

In [5]:
obj['b']

1.0

In [6]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

**可以通过单个值，或者多个值列表**

In [7]:
obj[1]

1.0

In [8]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

**可以按行切片**

In [9]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [ ]:
普通的切片不包含尾部，但是在Series与之不同

**可以使用布尔值索引**

In [10]:
obj[obj>2]

d    3.0
e    4.0
dtype: float64

**对索引的内容赋值时会改变原对象**

In [11]:
obj['b':'c']=5

In [12]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
e    4.0
dtype: float64

# 使用loc和iloc选择数据

In [14]:
data

          ones  two  three  four
ohio         0    1      2     3
colorado     4    5      6     7
utah         8    9     10    11
new york    12   13     14    15

**loc使用索引进行选择，iloc则按位置进行选择**

In [15]:
data.loc['colorado',['two','three']]

two      5
three    6
Name: colorado, dtype: int32

In [17]:
data.iloc[2,[3,0,1]]

four    11
ones     8
two      9
Name: utah, dtype: int32

**还可以用于切片**

In [18]:
data.loc[:'utah','two']

ohio        1
colorado    5
utah        9
Name: two, dtype: int32

In [19]:
data.iloc[:,:3][data.three>5]

          ones  two  three
colorado     4    5      6
utah         8    9     10
new york    12   13     14

In [20]:
data.iloc[2]

ones      8
two       9
three    10
four     11
Name: utah, dtype: int32